<?php
return [
    'title'             => 'ผลงานวิชาการอื่นๆ (สิทธิบัตร, อนุสิทธิบัตร, ลิขสิทธิ์)',
    'add_button'        => 'เพิ่ม',
    'no'                => 'ลำดับ',
    'name'              => 'ชื่อ',
    'type'              => 'ประเภท',
    'registration_date' => 'วันที่ได้รับลิขสิทธิ์',
    'ref_number'        => 'เลขทะเบียน',
    'ref_number_label'  => 'เลขที่ :',
    'creator'           => 'ผู้จัดทำ',
    'co_creator'        => 'ผู้จัดทำ (ร่วม)',
    'action'            => 'การกระทำ',
    'view'              => 'ดู',
    'edit'              => 'แก้ไข',
    'delete'            => 'ลบ',
    'confirm_title'     => 'คุณแน่ใจหรือไม่?',
    'confirm_text'      => 'คุณจะไม่สามารถกู้คืนไฟล์นี้ได้!',
    'delete_success'    => 'ลบสำเร็จ',
    'search'            => 'ค้นหา:',

    // สำหรับหน้าสร้าง/แก้ไขและรายละเอียด
    'edit_title'        => 'แก้ไขรายละเอียดผลงานวิชาการอื่นๆ',
    'card_description'  => 'กรอกข้อมูลรายละเอียดงานสิทธิบัตร, อนุสิทธิบัตร, ลิขสิทธิ์',
    'submit_button'     => 'บันทึก',
    'cancel_button'     => 'ยกเลิก',
    'back_button'       => 'กลับ',

    // สำหรับ Dynamic Fields
    'internal_authors'  => 'อาจารย์ในสาขา',
    'external_authors'  => 'บุคคลภายนอก',
    'select_member'     => 'เลือกสมาชิก',

    // สำหรับตำแหน่งผู้เขียน
    'pos' => [
        'first_author'        => 'ผู้เขียนคนแรก',
        'co_author'           => 'ผู้เขียนร่วม',
        'corresponding_author' => 'ผู้เขียนที่ติดต่อได้',
    ],

    // Placeholder สำหรับผู้เขียนภายนอก
    'placeholder' => [
        'author_fname' => 'กรอกชื่อ (First name)',
        'author_lname' => 'กรอกนามสกุล (Last name)',
    ],

    'error_title'       => 'เกิดข้อผิดพลาด!',
    'error_text'        => 'เกิดข้อผิดพลาดกับข้อมูลของคุณ กรุณาตรวจสอบอีกครั้ง',

    'types' => [
        'patent'        => 'สิทธิบัตร',
        'utility_model' => 'อนุสิทธิบัตร',
        'copyright'     => 'ลิขสิทธิ์',
    ],
    'select_type'  => 'โปรดเลือกประเภท',
    'ac_type'     => [
        'ลิขสิทธิ์'     => 'ลิขสิทธิ์',
        'อนุสิทธิบัตร' => 'อนุสิทธิบัตร',
        'สิทธิบัตร'    => 'สิทธิบัตร',
        'หนังสือ'       => 'หนังสือ',
    ],
    'Add' => 'เพิ่ม',
];
